In [1]:
import pandas as pd

## Creating the DataFrame

In [2]:
people = {
    'id': [4, 5, 2, 3, 1, 6],
    'name': ['Sam', 'Eleonore', 'Margaret', 'Ralf', 'Dean', 'Rig'],
    'surname': ['Hasmond', 'Hasmond', 'Sims', 'Maquita', 'Naed', 'Hight'],
    'age': [33, 35, 15, 32, 17, 90],
    'sex': ['M', 'F', 'F', 'M', 'M', 'M'],
    'email': ['samhasmond@hasmonds.com', 'eleonorehasmond@hasmonds.com', 'mag@me.to.com', 'mrmaquita@somene.maq.com', 'serinity@health.com', 'girmas@support.com'],
}
df = pd.DataFrame(people)

## Define the rows index

In [3]:
df.set_index('id', inplace=True) # Set id as index
df.sort_index(ascending=True, inplace=True) # Order dt asc
df

        name  surname  age sex                         email
id
1       Dean     Naed   17   M           serinity@health.com
2   Margaret     Sims   15   F                 mag@me.to.com
3       Ralf  Maquita   32   M      mrmaquita@somene.maq.com
4        Sam  Hasmond   33   M       samhasmond@hasmonds.com
5   Eleonore  Hasmond   35   F  eleonorehasmond@hasmonds.com
6        Rig    Hight   90   M            girmas@support.com

## Filter rows

In [4]:
# Filt by sex
male = (df['sex'] == 'M')
female = (df['sex'] == 'F')

# Filt adults
male_adult = (df['age'] > 18) & (df['sex'] == 'M')
female_adult = (df['age'] > 18) & (df['sex'] == 'F')

# Filt names
selecteds = (df['surname'] == 'Hasmond') | (df['name'] == 'Dean')

In [5]:
# view filtered result of Male
df.loc[male, ['name', 'age']]

    name  age
id
1   Dean   17
3   Ralf   32
4    Sam   33
6    Rig   90

In [6]:
# view filtered result of Female
df.loc[female, ['name', 'age']]

        name  age
id
2   Margaret   15
5   Eleonore   35

In [7]:
# view filtered Male adults
df.loc[male_adult, ['name', 'age']]

    name  age
id
3   Ralf   32
4    Sam   33
6    Rig   90

In [8]:
# view filtered Female adults
df.loc[female_adult, ['name', 'age']]

        name  age
id
5   Eleonore   35

In [9]:
# view filtered selecteds by some criteria
df.loc[selecteds, ['name', 'age', 'email']]

        name  age                         email
id
1       Dean   17           serinity@health.com
4        Sam   33       samhasmond@hasmonds.com
5   Eleonore   35  eleonorehasmond@hasmonds.com

In [10]:
# Show not selecteds
df.loc[~selecteds, ['name', 'age', 'email']]

        name  age                     email
id
2   Margaret   15             mag@me.to.com
3       Ralf   32  mrmaquita@somene.maq.com
6        Rig   90        girmas@support.com

## Update Collumns

In [11]:
# Update all collumns name
df.columns = [c.upper() for c in df.columns]
df.head(1)

    NAME SURNAME  AGE SEX                EMAIL
id
1   Dean    Naed   17   M  serinity@health.com

In [12]:
# Rename columns
df.columns = ['User Name', 'User Last Name', 'User Age', 'User Sex', 'Email']
df.head(1)

   User Name User Last Name  User Age User Sex                Email
id
1       Dean           Naed        17        M  serinity@health.com

In [13]:
# Replace space on columns
df.columns = df.columns.str.replace(' ', '_')
df.head(1)

   User_Name User_Last_Name  User_Age User_Sex                Email
id
1       Dean           Naed        17        M  serinity@health.com

In [14]:
# Update all collumns name
df.columns = [c.lower() for c in df.columns]
df.head(1)

   user_name user_last_name  user_age user_sex                email
id
1       Dean           Naed        17        M  serinity@health.com

In [15]:
# Update especific column name 
df.rename(columns={
    'user_name': 'name',
    'user_last_name': 'surname',
    'user_age': 'age',
    'user_sex': 'sex'
}, inplace=True)
df.head(1)

    name surname  age sex                email
id
1   Dean    Naed   17   M  serinity@health.com

## Update Rows

In [16]:
# Update single row of data By index
df.loc[1, 'surname'] = 'Marcley'
df.head(1)

    name  surname  age sex                email
id
1   Dean  Marcley   17   M  serinity@health.com

In [17]:
# Update single row of data By filter
_filter = (df['email'] == 'serinity@health.com') & (df['age'] == 17)
df.loc[_filter, 'surname'] = 'Havens'
df.head(1)

    name surname  age sex                email
id
1   Dean  Havens   17   M  serinity@health.com

In [18]:
# Update multiple rows of data
df['email'] = df['email'].str.upper()
df

        name  surname  age sex                         email
id
1       Dean   Havens   17   M           SERINITY@HEALTH.COM
2   Margaret     Sims   15   F                 MAG@ME.TO.COM
3       Ralf  Maquita   32   M      MRMAQUITA@SOMENE.MAQ.COM
4        Sam  Hasmond   33   M       SAMHASMOND@HASMONDS.COM
5   Eleonore  Hasmond   35   F  ELEONOREHASMOND@HASMONDS.COM
6        Rig    Hight   90   M            GIRMAS@SUPPORT.COM

### Update multiple rows of data

How to update multiple rows

#### Using:

- **Apply**
  - can by use in a DataFrame or in a Series object.
- **ApplyMap**
    - Apply the passing function in to an every individual element on a DataFrame
- **Map**
    - Only works on a Series. 
    - The map is used for substitute each value in a Series with another value.
- **Replace**
    - Only works on a Series.

##### Apply

In [19]:
# Apply
# Using apply to count the length of emails
# Passing the method to apply
df['email'].apply(len)

id
1    19
2    13
3    24
4    23
5    28
6    18
Name: email, dtype: int64

In [20]:
# Usin lambda on apply
df['email'] = df['email'].apply(lambda x: x.capitalize())
df

        name  surname  age sex                         email
id
1       Dean   Havens   17   M           Serinity@health.com
2   Margaret     Sims   15   F                 Mag@me.to.com
3       Ralf  Maquita   32   M      Mrmaquita@somene.maq.com
4        Sam  Hasmond   33   M       Samhasmond@hasmonds.com
5   Eleonore  Hasmond   35   F  Eleonorehasmond@hasmonds.com
6        Rig    Hight   90   M            Girmas@support.com

In [21]:
# Using a method
def lower_email(email):
    return email.lower()

In [27]:
# Calling the method
df['email'] = df['email'].apply(lower_email)
df

        name  surname  age sex                         email
id
1       Dean   Havens   17   M           serinity@health.com
2   Margaret     Sims   15   F                 mag@me.to.com
3       Ralf  Maquita   32   M      mrmaquita@somene.maq.com
4        Sam  Hasmond   33   M       samhasmond@hasmonds.com
5   Eleonore  Hasmond   35   F  eleonorehasmond@hasmonds.com
6        Rig    Hight   90   M            girmas@support.com

##### ApplyMap

In [35]:
def len_of(row):
    return len(row) if type(row) is str else row

In [36]:
df.applymap(len_of)

    name  surname  age  sex  email
id
1      4        6   17    1     19
2      8        4   15    1     13
3      4        7   32    1     24
4      3        7   33    1     23
5      8        7   35    1     28
6      3        5   90    1     18

##### Map

In [37]:
# When use map to replace values, only the keys defined in dictionary will be setted
# Others values will receive NaN
df['name'].map({
    'Dean': 'Marcley',
    'Sam': 'Walt' 
})

id
1    Marcley
2        NaN
3        NaN
4       Walt
5        NaN
6        NaN
Name: name, dtype: object

##### Filter

In [42]:
# Filter will replace only the values defined in the dictionary
# Keeping the other values untoched
df['name'].replace({
    'Dean': 'Marcley',
    'Sam': 'Walt' 
})

id
1     Marcley
2    Margaret
3        Ralf
4        Walt
5    Eleonore
6         Rig
Name: name, dtype: object

> To apply `map` and `replace` set the return value to the Serie e.g.: `df['name'] = df['name'].replace...`